RIET/src/DataProcessors/PullExportRequestsFromTMSEmails/PullExportRequestsFromTMSEmails.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>PullExportRequestsFromTMSEmails</name>
  <tabularSections>
    <name>Unprocessed</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SentDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>From</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Subject</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Body</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RIET/src/InformationRegisters/UIDsOfProcessedEmails/UIDsOfProcessedEmails.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UIDsOfProcessedEmails</name>
  <dimensions>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/DataProcessors/PullExportRequestsFromTMSEmails/Forms/Форма/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////
// RECEIVE EMAILS

&НаКлиенте
Процедура ReceiveEmails(Команда)
		
	ReceiveEmailsНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ReceiveEmailsНаСервере()
		
	УстановитьПривилегированныйРежим(Истина);
	
	ИнтернетПочтовыйПрофиль = ImportExportСерверПовтИспСеанс.ПолучитьИнтернетПочтовыйПрофиль();
 	ИнтернетПочта = ImportExportСервер.ПодключитьсяКИнтернетПочте(ИнтернетПочтовыйПрофиль);
	
	ОписаниеОшибки = Неопределено;
	Попытка
		UnprocessedEmails = ImportExportСервер.ПолучитьUnprocessedEmails(ИнтернетПочта, ИнтернетПочтовыйПрофиль.ПользовательIMAP);
	Исключение
		ОписаниеОшибки = "Failed to get unprocessed emails:
			|" + ОписаниеОшибки();
	КонецПопытки;
	
	ИнтернетПочта.Отключиться();
	
	Если ОписаниеОшибки <> Неопределено Тогда
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
	
	FillUnprocessed(UnprocessedEmails);
	
КонецПроцедуры

&НаСервере
Процедура FillUnprocessed(UnprocessedEmails)
	
	Объект.Unprocessed.Очистить();
	Для Каждого Письмо Из UnprocessedEmails Цикл
		
		Если СтрНайти(Письмо.Тема, "[TMS Offline Service:Transport Request]:Shipment from") <> 1 Тогда 
			Продолжить;	
		КонецЕсли;
		
		НоваяСтрока = Объект.Unprocessed.Добавить();
		
		НоваяСтрока.UID = Письмо.Идентификатор[0];
		
		НоваяСтрока.SentDate = Письмо.ДатаОтправления;
		
		НоваяСтрока.From = Письмо.Отправитель.Адрес;
		
		НоваяСтрока.Subject = Письмо.Тема;
		
		НоваяСтрока.Body = ImportExportСервер.ПолучитьПростойТекстПисьма(Письмо);
						
	КонецЦикла;	
		
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// LOAD

&НаКлиенте
Процедура Load(Команда)
	
	ИДВыделенныхСтрок = Элементы.Unprocessed.ВыделенныеСтроки;
	Если НЕ ИДВыделенныхСтрок.Количество() Тогда
		Сообщить("Select at least one not processed e-mail!");
		Возврат;
	КонецЕсли;
	
	МассивUIDs = Новый Массив;
	Для Каждого ИДВыделеннойСтроки Из ИДВыделенныхСтрок Цикл
		
		СтрокаТЧ = Объект.Unprocessed.НайтиПоИдентификатору(ИДВыделеннойСтроки);
		МассивUIDs.Добавить(СтрокаТЧ.UID);
		
	КонецЦикла;

	ЗагрузитьНаСервере(МассивUIDs);
			
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(МассивUIDs)
	
	УстановитьПривилегированныйРежим(Истина);

	ИнтернетПочтовыйПрофиль = ImportExportСерверПовтИспСеанс.ПолучитьИнтернетПочтовыйПрофиль();
 	ИнтернетПочта = ImportExportСервер.ПодключитьсяКИнтернетПочте(ИнтернетПочтовыйПрофиль);
		
	ОписаниеОшибки = Неопределено;
	Попытка
		Письма = ИнтернетПочта.Выбрать(Ложь, МассивUIDs);
		Обработки.PullExportRequestsFromTMSEmails.ОбработатьПисьма(Письма, ИнтернетПочта, ИнтернетПочтовыйПрофиль.ПользовательSMTP);
	Исключение
		ОписаниеОшибки = "Failed to load Export requests from selected e-mails:
			|" + ОписаниеОшибки();
	КонецПопытки;
	
	ИнтернетПочта.Отключиться();
	
	Если ОписаниеОшибки <> Неопределено Тогда
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
	
	ReceiveEmailsНаСервере();
	Элементы.Processed.Обновить();
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////
// MARK AS PROCESSED

&НаКлиенте
Процедура MarkAsProcessed(Команда)
	
	ИДВыделенныхСтрок = Элементы.Unprocessed.ВыделенныеСтроки;
	Если НЕ ИДВыделенныхСтрок.Количество() Тогда
		Сообщить("Select at least one not processed e-mail!");
		Возврат;
	КонецЕсли;
	
	МассивUIDs = Новый Массив;
	Для Каждого ИДВыделеннойСтроки Из ИДВыделенныхСтрок Цикл
		
		СтрокаТЧ = Объект.Unprocessed.НайтиПоИдентификатору(ИДВыделеннойСтроки);
		МассивUIDs.Добавить(СтрокаТЧ.UID);
		
	КонецЦикла;
	
	MarkAsProcessedНаСервере(МассивUIDs);
	
КонецПроцедуры

&НаСервере
Процедура MarkAsProcessedНаСервере(МассивUIDs)
	
	ИнтернетПочтовыйПрофиль = ImportExportСерверПовтИспСеанс.ПолучитьИнтернетПочтовыйПрофиль();
 	ИнтернетПочта = ImportExportСервер.ПодключитьсяКИнтернетПочте(ИнтернетПочтовыйПрофиль);
	
	РегистрыСведений.UIDsOfProcessedEmails.ДобавитьНесколько(МассивUIDs, ИнтернетПочтовыйПрофиль.ПользовательIMAP);
	ReceiveEmailsНаСервере();
	Элементы.Processed.Обновить();
	
КонецПроцедуры
